Repository: linux-l10n-vi/Sudoku
Catalog: po/*.po
Languages: vi

source: Solve Sudoku puzzles
vi: Giải câu đố Sudoku

source: Solve puzzles in style
vi: Giải câu đố theo phong cách

source: Sudoku is a puzzle app that lets you solve classic number-placement challenges. It features a clean, distraction-free design with a simple interface to keep you focused and engaged.
vi: Sudoku là một ứng dụng giải đố cho phép bạn giải các thử thách xếp số cổ điển. Nó có thiết kế gọn gàng, không gây xao lãng với giao diện đơn giản giúp bạn tập trung và tương tác.

source: Features:
vi: Tính năng:

source: Modern GTK4 and libadwaita interface
vi: Giao diện GTK4 và libadwaita hiện đại

source: Keyboard shortcuts for quick access to all functions
vi: Phím tắt để truy cập nhanh vào tất cả các chức năng

source: Save and load games seamlessly to continue your progress anytime
vi: Lưu và tải trò chơi một cách liền mạch để tiếp tục tiến trình của bạn bất cứ lúc nào

source: Highlight active row and cell to improve focus and ease of play
vi: Làm nổi bật hàng và ô đang hoạt động để cải thiện sự tập trung và dễ chơi

source: Conflict highlighting to help identify mistakes, ideal for beginners
vi: Làm nổi bật xung đột để giúp xác định lỗi, lý tưởng cho người mới bắt đầu

source: Suitable for all skill levels, from beginners to experts
vi: Thích hợp cho mọi cấp độ kỹ năng, từ người mới bắt đầu đến chuyên gia

source: Sudoku in light mode
vi: Sudoku ở chế độ sáng

source: Sudoku in dark mode
vi: Sudoku ở chế độ tối

source: Sudoku landing page in dark mode
vi: Trang đích Sudoku ở chế độ tối

source: Sudoku landing page in light mode
vi: Trang đích Sudoku ở chế độ sáng

source: puzzle
vi: câu đố

source: game
vi: trò chơi

source: numbers
vi: con số

source: Fixed game not being remembered after re-opening Sudoku
vi: Đã sửa lỗi trò chơi không được ghi nhớ sau khi mở lại Sudoku

source: Also moved the Back to main menu button from the primary menu to the headerbar
vi: Đồng thời di chuyển nút Quay lại menu chính từ menu chính sang thanh tiêu đề

source: Updated completion screen and added a difficulty subtitle:
vi: Cập nhật màn hình hoàn thành và thêm phụ đề độ khó:

source: Completion screen now shows randomized messages with improved imagery
vi: Màn hình hoàn thành hiện hiển thị các thông báo ngẫu nhiên với hình ảnh được cải thiện

source: Added difficulty level as a subtitle in the header bar
vi: Đã thêm mức độ khó làm phụ đề trong thanh tiêu đề

source: Updated shortcuts:
vi: Cập nhật phím tắt:

source: Added F10 as primary menu's shortcut
vi: Đã thêm F10 làm phím tắt của menu chính

source: Added Ctrl + w to close Sudoku
vi: Đã thêm Ctrl + W để đóng Sudoku

source: Additionally, a logging issue when pencil mode was turned on/off is now fixed.
vi: Ngoài ra, sự cố ghi nhật ký khi bật/tắt chế độ bút chì hiện đã được khắc phục.

source: Enhanced screen reader support for Sudoku, making the game more accessible and intuitive for players who rely on assistive technologies. With these improvements, users can now:
vi: Hỗ trợ trình đọc màn hình nâng cao cho Sudoku, giúp trò chơi dễ tiếp cận và trực quan hơn đối với những người chơi dựa vào công nghệ hỗ trợ. Với những cải tiến này, giờ đây người dùng có thể:

source: Receive clear feedback on whether the number they entered is correct or incorrect
vi: Nhận được phản hồi rõ ràng về việc con số họ nhập vào là đúng hay sai

source: Navigate the Sudoku interface more easily and efficiently
vi: Điều hướng giao diện Sudoku dễ dàng và hiệu quả hơn

source: Additionally, a visual bug affecting the pencil icon has been fixed.
vi: Ngoài ra, lỗi hình ảnh hưởng đến biểu tượng bút chì đã được sửa.

source: First stable release of Sudoku! A modern GTK4/libadwaita application for playing Sudoku puzzles.
vi: Bản phát hành ổn định đầu tiên của Sudoku! Một ứng dụng GTK4/libadwaita hiện đại để chơi các câu đố Sudoku.

source: Continue Game
vi: Tiếp tục trò chơi

source: New Game
vi: Trò chơi mới

source: Back to main menu
vi: Quay lại menu chính

source: Toggle Pencil Mode
vi: Chuyển đổi chế độ bút chì

source: Sudoku Game Icon
vi: Biểu tượng trò chơi Sudoku

source: Play Sudoku
vi: Chơi Sudoku

source: _Continue Game
vi: Tiếp tục trò _chơi

source: _New Game
vi: Trò chơi _mới

source: _Keyboard Shortcuts
vi: _Phím tắt

source: Keyboard shortcuts
vi: Phím tắt

source: How to play
vi: Cách chơi

source: _About
vi: _Giới thiệu

source: About
vi: Giới thiệu

source: _Quit
vi: _Thoát

source: Quit
vi: Thoát

source: Back to Main Menu
vi: Quay lại menu chính

# shortcut window
source: Game
vi: Trò chơi

# shortcut window
source: Pencil Mode
vi: Chế độ bút chì

# shortcut window
source: General
vi: Chung

# shortcut window
source: Show Shortcuts
vi: Hiển thị phím tắt

# shortcut window
source: Back to Main Menu
vi: Quay lại menu chính

# shortcut window
source: Quit
vi: Thoát

source: Sudoku Master! You've solved the puzzle with perfect logic!
vi: Bậc thầy Sudoku! Bạn đã giải được câu đố một cách logic hoàn hảo!

source: Incredible! Every number found its perfect place!
vi: Đáng kinh ngạc! Mọi con số đều tìm thấy vị trí hoàn hảo của nó!

source: Brilliant deduction! You've conquered this Sudoku challenge!
vi: Suy luận tuyệt vời! Bạn đã chinh phục được thử thách Sudoku này!

source: Perfect solution! Your logical thinking is outstanding!
vi: Giải pháp hoàn hảo! Tư duy logic của bạn thật xuất sắc!

source: Amazing work! You've mastered the art of Sudoku!
vi: Công việc tuyệt vời! Bạn đã thành thạo nghệ thuật Sudoku!

source: Fantastic! Every row, column, and box is perfectly filled!
vi: Tuyệt vời! Mỗi hàng, cột và hộp đều được lấp đầy hoàn hảo!

source: Outstanding! Your puzzle-solving skills are remarkable!
vi: Nổi bật! Kỹ năng giải câu đố của bạn thật đáng chú ý!

source: Excellent! You've completed the Sudoku with flying colors!
vi: Xuất sắc! Bạn đã hoàn thành Sudoku một cách xuất sắc!

source: Spectacular! Your mathematical reasoning is top-notch!
vi: Ngoạn mục! Lý luận toán học của bạn là đỉnh cao!

source: Well done! You've proven yourself a Sudoku champion!
vi: Làm tốt! Bạn đã chứng tỏ mình là nhà vô địch Sudoku!

source: Congratulations! You've solved the puzzle flawlessly!
vi: Chúc mừng! Bạn đã giải được câu đố một cách hoàn hảo!

source: Victory! Your strategic thinking led to perfect completion!
vi: Chiến thắng! Tư duy chiến lược của bạn đã dẫn đến sự hoàn thành hoàn hảo!

source: Genius! You've mastered the Sudoku grid with precision!
vi: Thiên tài! Bạn đã thành thạo lưới Sudoku một cách chính xác!

source: Masterpiece! Every number placement was calculated perfectly!
vi: Kiệt tác! Mọi vị trí số đều được tính toán hoàn hảo!

source: Phenomenal! You've conquered this Sudoku with style!
vi: Phi thường! Bạn đã chinh phục được trò chơi Sudoku này một cách đầy phong cách!

source: Wrong
vi: Sai

source: Clear Cell
vi: Xóa ô

source: How to Play Sudoku
vi: Cách chơi Sudoku

source: Welcome to Sudoku!
vi: Chào mừng đến với Sudoku!

source: The goal is to fill the grid so that every row, column, and 3x3 box contains the numbers 1 through 9 without repeats.
vi: Mục tiêu là lấp đầy lưới sao cho mỗi hàng, cột và ô 3x3 đều chứa các số từ 1 đến 9 mà không lặp lại.

source: How to play:
vi: Cách chơi:

source: – Click on an empty cell to select it.
vi: – Bấm vào ô trống để chọn ô đó.

source: – Use your keyboard or pencil tool to input a number.
vi: – Sử dụng bàn phím hoặc công cụ bút chì để nhập số.

source: – Use the pencil tool to make notes.
vi: – Dùng công cụ bút chì để ghi chú.

source: – Use the backspace key to clear a cell.
vi: – Dùng phím Backspace để xóa một ô.

source: – Try to solve the puzzle logically.
vi: – Cố gắng giải câu đố một cách logic.

source: Good luck and have fun!
vi: Chúc may mắn và vui vẻ!

source: Select Difficulty
vi: Chọn độ khó

source: Easy
vi: Dễ

source: Medium
vi: Trung bình

source: Hard
vi: Khó

source: Extreme
vi: Cực khó

source: Start new game with {} difficulty
vi: Bắt đầu trò chơi mới với độ khó {}
